{"format": "graph-model", "generatedBy": "2.1.0", "convertedBy": "TensorFlow.js Converter v1.2.3", "modelTopology": {"node": [{"name": "accuracy_calc/prediction/dimension", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "output_layer/b4", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "10"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "output_layer/w4", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "10"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "third_layer/b3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "third_layer/w3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "second_hidden_layer/b2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "second_hidden_layer/w2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1024"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "first_hidden_layer/b1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "first_hidden_layer/w1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "784"}, {"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "X", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "784"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "first_hidden_layer/MatMul", "op": "MatMul", "input": ["X", "first_hidden_layer/w1"], "attr": {"transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}}}, {"name": "first_hidden_layer/add", "op": "AddV2", "input": ["first_hidden_layer/MatMul", "first_hidden_layer/b1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "first_hidden_layer/Relu", "op": "Relu", "input": ["first_hidden_layer/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "second_hidden_layer/MatMul", "op": "MatMul", "input": ["first_hidden_layer/Relu", "second_hidden_layer/w2"], "attr": {"transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}}}, {"name": "second_hidden_layer/add", "op": "AddV2", "input": ["second_hidden_layer/MatMul", "second_hidden_layer/b2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "second_hidden_layer/Relu", "op": "Relu", "input": ["second_hidden_layer/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "third_layer/MatMul", "op": "MatMul", "input": ["second_hidden_layer/Relu", "third_layer/w3"], "attr": {"transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}}}, {"name": "third_layer/add", "op": "AddV2", "input": ["third_layer/MatMul", "third_layer/b3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "third_layer/Relu", "op": "Relu", "input": ["third_layer/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "output_layer/MatMul", "op": "MatMul", "input": ["third_layer/Relu", "output_layer/w4"], "attr": {"transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}}}, {"name": "output_layer/add", "op": "AddV2", "input": ["output_layer/MatMul", "output_layer/b4"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "output_layer/Softmax", "op": "Softmax", "input": ["output_layer/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "accuracy_calc/prediction", "op": "ArgMax", "input": ["output_layer/Softmax", "accuracy_calc/prediction/dimension"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "output_type": {"type": "DT_INT64"}}}], "library": {}, "versions": {"producer": 38}}, "weightsManifest": [{"paths": ["group1-shard1of2.bin", "group1-shard2of2.bin"], "weights": [{"name": "accuracy_calc/prediction/dimension", "shape": [], "dtype": "int32"}, {"name": "output_layer/b4", "shape": [10], "dtype": "float32"}, {"name": "output_layer/w4", "shape": [64, 10], "dtype": "float32"}, {"name": "third_layer/b3", "shape": [64], "dtype": "float32"}, {"name": "third_layer/w3", "shape": [512, 64], "dtype": "float32"}, {"name": "second_hidden_layer/b2", "shape": [512], "dtype": "float32"}, {"name": "second_hidden_layer/w2", "shape": [1024, 512], "dtype": "float32"}, {"name": "first_hidden_layer/b1", "shape": [1024], "dtype": "float32"}, {"name": "first_hidden_layer/w1", "shape": [784, 1024], "dtype": "float32"}]}]}